<?php

return [
    'name' => 'الأسئلة الشائعة',
    'create' => 'سؤال شائع جديد',
    'question' => 'السؤال',
    'answer' => 'الإجابة',
    'question_placeholder' => 'أدخل سؤالك...',
    'answer_placeholder' => 'أدخل إجابتك...',
    'category' => 'التصنيف',
    'faq_schema_config' => 'إعداد مخطط الأسئلة الشائعة (:link)',
    'faq_schema_config_description' => 'يسجّل هذا الإعداد بيانات الأسئلة الشائعة المنظمة لأغراض تحسين محركات البحث فقط. لن تظهر في محتوى قالب الواجهة الأمامية لديك. يتم تضمين المخطط في كود مصدر الصفحة ويمكن مشاهدته باستخدام عرض المصدر أو اختباره باستخدام أداة اختبار النتائج الغنية من Google.',
    'schema_testing_tool' => 'الاختبار باستخدام أداة اختبار النتائج الغنية من Google',
    'learn_more' => 'معرفة المزيد',
    'settings' => [
        'title' => 'الأسئلة الشائعة',
        'description' => 'عرض وتحديث إعدادات الأسئلة الشائعة',
        'enable_faq_schema' => 'تفعيل مخطط الأسئلة الشائعة؟',
        'enable_faq_schema_description' => 'معرفة المزيد: :url',
    ],
    'select_category' => 'اختر تصنيفًا',
    'add_item' => 'إضافة عنصر',
    'or' => 'أو',
    'faqs_menu_name' => 'المسؤول -> الأسئلة الشائعة -> إنشاء',
    'select_from_existing' => 'الاختيار من الأسئلة الشائعة الموجودة',
    'no_existing' => 'لا توجد أسئلة شائعة حالية، يرجى إنشاء واحدة أولاً عبر :link.',
];
