<?php

return [
    'settings' => [
        'title' => 'تحسين',
        'description' => 'تصغير مخرجات HTML، وجعل CSS مضمّنة، وإزالة التعليقات...',
        'enable' => 'هل تريد تمكين تحسين سرعة الصفحة؟',
    ],
    'collapse_white_space' => 'طي المسافات البيضاء',
    'collapse_white_space_description' => 'يعمل هذا المرشح على تقليل البايتات المنقولة في ملف HTML عن طريق إزالة المسافات البيضاء غير الضرورية.',
    'elide_attributes' => 'حذف السمات',
    'elide_attributes_description' => 'يعمل هذا المرشح على تقليل حجم نقل ملفات HTML عن طريق إزالة السمات من الوسوم عندما تكون القيمة المحددة مساوية للقيمة الافتراضية لتلك السمة. يمكن أن يوفر ذلك عددًا متواضعًا من البايتات، وقد يجعل المستند أكثر قابلية للضغط عبر توحيد الوسوم المتأثرة.',
    'inline_css' => 'CSS مضمّنة',
    'inline_css_description' => 'يعمل هذا المرشح على تحويل سمة النمط المضمّنة للوسوم إلى فئات عن طريق نقل CSS إلى الرأس.',
    'insert_dns_prefetch' => 'إدراج الجلب المسبق لـ DNS',
    'insert_dns_prefetch_description' => 'يقوم هذا المرشح بحقن وسوم في HEAD لتمكين المتصفح من إجراء الجلب المسبق لـ DNS.',
    'remove_comments' => 'إزالة التعليقات',
    'remove_comments_description' => 'يعمل هذا المرشح على إزالة تعليقات HTML وJS وCSS. يقلل المرشح من حجم نقل ملفات HTML عن طريق إزالة التعليقات. اعتمادًا على ملف HTML، يمكن لهذا المرشح أن يقلل بشكل كبير من عدد البايتات المنقولة عبر الشبكة.',
    'remove_quotes' => 'إزالة علامات الاقتباس',
    'remove_quotes_description' => 'يزيل هذا المرشح علامات الاقتباس غير الضرورية من سمات HTML. وعلى الرغم من أن مواصفات HTML المختلفة تتطلبها، تسمح المتصفحات بحذفها عندما تتكون قيمة السمة من مجموعة فرعية معينة من الأحرف (الأحرف الأبجدية الرقمية وبعض أحرف الترقيم).',
    'defer_javascript' => 'تأجيل جافا سكريبت',
    'defer_javascript_description' => 'يؤجل تنفيذ جافا سكريبت في HTML. إذا لزم الأمر، يمكنك إلغاء التأجيل في بعض البرامج النصية باستخدام data-pagespeed-no-defer كسمة للبرنامج النصي.',
];
