<?php

return [
    'login' => [
        'username' => 'البريد الإلكتروني/اسم المستخدم',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'title' => 'تسجيل دخول المستخدم',
        'remember' => 'تذكرني؟',
        'login' => 'تسجيل الدخول',
        'placeholder' => [
            'username' => 'أدخل اسم المستخدم أو عنوان البريد الإلكتروني',
            'email' => 'أدخل عنوان بريدك الإلكتروني',
            'password' => 'أدخل كلمة المرور الخاصة بك',
        ],
        'success' => 'تم تسجيل الدخول بنجاح!',
        'fail' => 'اسم المستخدم أو كلمة المرور غير صحيحة.',
        'not_active' => 'لم يتم تفعيل حسابك بعد!',
        'banned' => 'تم حظر هذا الحساب.',
        'logout_success' => 'تم تسجيل الخروج بنجاح!',
        'dont_have_account' => 'ليس لديك حساب على هذا النظام، يرجى الاتصال بالمسؤول لمزيد من المعلومات!',
    ],
    'forgot_password' => [
        'title' => 'نسيت كلمة المرور',
        'message' => '<p>هل نسيت كلمة المرور الخاصة بك؟</p><p>يرجى إدخال بريدك الإلكتروني. سيقوم النظام بإرسال بريد إلكتروني يحتوي على رابط نشط لإعادة تعيين كلمة المرور.</p>',
        'submit' => 'إرسال',
    ],
    'reset' => [
        'new_password' => 'كلمة مرور جديدة',
        'password_confirmation' => 'تأكيد كلمة المرور الجديدة',
        'email' => 'البريد الإلكتروني',
        'title' => 'إعادة تعيين كلمة المرور',
        'update' => 'تحديث',
        'wrong_token' => 'هذا الرابط غير صالح أو منتهي الصلاحية. يرجى المحاولة مرة أخرى باستخدام نموذج إعادة التعيين.',
        'user_not_found' => 'اسم المستخدم هذا غير موجود.',
        'success' => 'تمت إعادة تعيين كلمة المرور بنجاح!',
        'fail' => 'الرمز غير صالح، لقد انتهت صلاحية رابط إعادة تعيين كلمة المرور!',
        'reset' => [
            'title' => 'إعادة تعيين كلمة المرور عبر البريد الإلكتروني',
        ],
        'send' => [
            'success' => 'تم إرسال بريد إلكتروني إلى حسابك. يرجى التحقق منه وإكمال هذا الإجراء.',
            'fail' => 'تعذر إرسال البريد الإلكتروني في هذا الوقت. يرجى المحاولة لاحقًا.',
        ],
        'new-password' => 'كلمة مرور جديدة',
        'placeholder' => [
            'new_password' => 'أدخل كلمة المرور الجديدة',
            'new_password_confirmation' => 'أكد كلمة المرور الجديدة',
        ],
    ],
    'email' => [
        'reminder' => [
            'title' => 'إعادة تعيين كلمة المرور عبر البريد الإلكتروني',
        ],
    ],
    'password_confirmation' => 'تأكيد كلمة المرور',
    'failed' => 'فشل',
    'throttle' => 'تقييد المحاولات',
    'not_member' => 'لست عضوًا بعد؟',
    'register_now' => 'سجّل الآن',
    'lost_your_password' => 'هل نسيت كلمة المرور؟',
    'login_title' => 'المشرف',
    'login_via_social' => 'تسجيل الدخول عبر الشبكات الاجتماعية',
    'back_to_login' => 'العودة إلى صفحة تسجيل الدخول',
    'sign_in_below' => 'سجّل الدخول أدناه',
    'languages' => 'اللغات',
    'reset_password' => 'إعادة تعيين كلمة المرور',
    'deactivated_message' => 'تم تعطيل حسابك. يرجى الاتصال بالمسؤول.',
    'password_changed_message' => 'تم تغيير كلمة المرور الخاصة بك. يرجى تسجيل الدخول مرة أخرى باستخدام كلمة المرور الجديدة.',
    'settings' => [
        'email' => [
            'title' => 'قائمة التحكم في الوصول (ACL)',
            'description' => 'إعدادات البريد الإلكتروني لقائمة التحكم في الوصول (ACL)',
            'templates' => [
                'password_reminder' => [
                    'title' => 'إعادة تعيين كلمة المرور',
                    'description' => 'إرسال بريد إلكتروني إلى المستخدم عند طلب إعادة تعيين كلمة المرور',
                    'subject' => 'إعادة تعيين كلمة المرور',
                    'reset_link' => 'رابط إعادة تعيين كلمة المرور',
                    'email_title' => 'إرشادات إعادة تعيين كلمة المرور',
                    'email_message' => 'تلقيت هذا البريد الإلكتروني لأننا استلمنا طلبًا لإعادة تعيين كلمة المرور الخاصة بحسابك.',
                    'button_text' => 'إعادة تعيين كلمة المرور',
                    'trouble_text' => 'إذا كنت تواجه مشكلة في النقر على زر "إعادة تعيين كلمة المرور"، فانسخ الرابط أدناه والصقه في متصفح الويب: <a href=:reset_link>:reset_link</a> ثم الصقه في متصفحك. إذا لم تكن قد طلبت إعادة تعيين كلمة المرور، فيرجى تجاهل هذه الرسالة أو الاتصال بنا إذا كانت لديك أي أسئلة.',
                ],
            ],
        ],
    ],
];
