<?php

return [
    'create' => 'إنشاء تصنيف جديد',
    'menu' => 'التصنيفات',
    'edit_this_category' => 'تحرير هذا التصنيف',
    'menu_name' => 'التصنيفات',
    'none' => 'لا شيء',
    'total_posts' => 'إجمالي المشاركات: :total',
    'table_view_info' => 'لإدارة أكثر سهولة للتصنيفات بشكل جماعي، يمكنك أيضًا',
    'manage_as_table' => 'إدارة التصنيفات كجدول',
    'parent' => 'التصنيف الأب',
    'order' => 'الترتيب',
    'is_default' => 'هل هو الافتراضي',
    'intro' => [
        'description' => 'نظّم مشاركات مدونتك في تصنيفات لإدارة أفضل للمحتوى.',
    ],
];
